mattmc3/ez-compinit
mattmc3/zfunctions
marlonrichert/zsh-edit
marlonrichert/zsh-hist                  kind:defer
reegnz/jq-zsh-plugin                    kind:defer
zsh-users/zsh-autosuggestions           kind:defer
zsh-users/zsh-completions               kind:fpath path:src
zsh-users/zsh-history-substring-search  kind:defer
zsh-users/zsh-syntax-highlighting       kind:defer

getantidote/use-omz
ohmyzsh/ohmyzsh                         path:lib
ohmyzsh/ohmyzsh                         path:plugins/aliases
ohmyzsh/ohmyzsh                         path:plugins/aws
ohmyzsh/ohmyzsh                         path:plugins/brew
ohmyzsh/ohmyzsh                         path:plugins/colored-man-pages
ohmyzsh/ohmyzsh                         path:plugins/command-not-found
ohmyzsh/ohmyzsh                         path:plugins/copybuffer
ohmyzsh/ohmyzsh                         path:plugins/copyfile
ohmyzsh/ohmyzsh                         path:plugins/copypath
ohmyzsh/ohmyzsh                         path:plugins/eza
ohmyzsh/ohmyzsh                         path:plugins/fzf
ohmyzsh/ohmyzsh                         path:plugins/gh
ohmyzsh/ohmyzsh                         path:plugins/git
ohmyzsh/ohmyzsh                         path:plugins/kubectl
ohmyzsh/ohmyzsh                         path:plugins/kubectx
ohmyzsh/ohmyzsh                         path:plugins/magic-enter
ohmyzsh/ohmyzsh                         path:plugins/man
ohmyzsh/ohmyzsh                         path:plugins/pip
ohmyzsh/ohmyzsh                         path:plugins/podman
ohmyzsh/ohmyzsh                         path:plugins/safe-paste
ohmyzsh/ohmyzsh                         path:plugins/ssh
ohmyzsh/ohmyzsh                         path:plugins/sudo
ohmyzsh/ohmyzsh                         path:plugins/systemadmin
ohmyzsh/ohmyzsh                         path:plugins/tldr
ohmyzsh/ohmyzsh                         path:plugins/tmux
ohmyzsh/ohmyzsh                         path:plugins/web-search