mattmc3/ez-compinit
mattmc3/zfunctions
marlonrichert/zsh-edit
marlonrichert/zsh-hist
reegnz/jq-zsh-plugin                # kind:defer
zsh-users/zsh-autosuggestions       # kind:defer
zsh-users/zsh-completions           kind:fpath path:src
zsh-users/zsh-history-substring-search  # kind:defer
zsh-users/zsh-syntax-highlighting   # kind:defer

getantidote/use-omz
ohmyzsh/ohmyzsh                     path:lib
ohmyzsh/ohmyzsh                     path:plugins/aliases
ohmyzsh/ohmyzsh                     path:plugins/aws # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/brew # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/colored-man-pages # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/command-not-found # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/copybuffer # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/copyfile # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/copypath # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/eza # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/fzf # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/gh # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/kubectl # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/kubectx # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/magic-enter
ohmyzsh/ohmyzsh                     path:plugins/man # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/pip # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/podman # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/safe-paste
ohmyzsh/ohmyzsh                     path:plugins/ssh # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/sudo # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/systemadmin # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/tldr # kind:defer
ohmyzsh/ohmyzsh                     path:plugins/tmux
ohmyzsh/ohmyzsh                     path:plugins/web-search # kind:defer