# 'brew install'
brew "advancecomp" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p advancecomp >/dev/null"
brew "aws2-wrap" if OS.mac?
brew "awscli" if OS.mac?
brew "azure-cli" if OS.mac?
brew "bandwhich" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p bandwhich >/dev/null"
brew "bash" if OS.mac?
brew "bat" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p bat >/dev/null"
brew "bc" if OS.mac?
brew "btop" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p btop >/dev/null"
brew "chezmoi" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p chezmoi >/dev/null"
brew "coreutils" if OS.mac?
brew "ctop" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p ctop >/dev/null"
brew "cyme" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p cyme >/dev/null"
brew "direnv" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p direnv >/dev/null"
brew "dive" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p dive >/dev/null"
brew "distrobox" if OS.linux? and not system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p distrobox >/dev/null"
brew "docker-compose" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p docker-compose >/dev/null"
brew "duti" if OS.mac?
brew "dysk" if OS.linux? and not system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p dysk >/dev/null"
brew "eye-d3" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p eyeD3 >/dev/null"
brew "eza" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p eza >/dev/null"
brew "fd" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p fd >/dev/null"
brew "flux" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p flux >/dev/null"
brew "fortune" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p fortune >/dev/null"
brew "fzf" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p fzf >/dev/null"
brew "gawk" if OS.mac?
brew "gh" if OS.mac?
brew "glab" if OS.mac?
brew "git" unless not OS.mac? and system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p git >/dev/null"
brew "git-delta" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p delta >/dev/null"
brew "gnu-sed" if OS.mac?
brew "gnupg" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p gpg >/dev/null"
brew "go" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p go >/dev/null"
brew "graphicsmagick" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p gm >/dev/null"
brew "grep" if OS.mac?
brew "grype" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p grype >/dev/null"
brew "helm" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p helm >/dev/null"
brew "id3v2" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p id3v2 >/dev/null"
brew "ipcalc" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p ipcalc >/dev/null"
brew "jpegoptim" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p jpegoptim >/dev/null"
brew "jq" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p jq >/dev/null"
brew "just" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p just >/dev/null"
brew "k9s" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p k9s >/dev/null"
brew "kind" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p kind >/dev/null"
brew "ko" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p ko >/dev/null"
brew "kubernetes-cli" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p kubectl >/dev/null"
brew "kubectx" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p kubectx >/dev/null"
brew "lame" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p lame >/dev/null"
brew "lazygit" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p lazygit >/dev/null"
brew "lnav" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p lnav >/dev/null"
brew "mas" if OS.mac?
brew "mdcat" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p mdcat >/dev/null"
brew "minio-mc" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p mc >/dev/null"
brew "mp3gain" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p mp3gain >/dev/null"
brew "neovim" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p nvim >/dev/null"
brew "nmap" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p nmap >/dev/null"
brew "npm" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p npm >/dev/null"
brew "oh-my-posh" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p oh-my-posh >/dev/null"
brew "optipng" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p optipng >/dev/null"
brew "p7zip" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p 7z >/dev/null"
brew "python3" if OS.mac?
brew "rust-parallel" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p parallel >/dev/null"
brew "podman" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p podman >/dev/null"
brew "ripgrep" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p rg >/dev/null"
brew "rsync" unless not OS.mac? and system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p rsync >/dev/null"
brew "shellcheck" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p shellcheck >/dev/null"
brew "stress-ng" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p stress-ng >/dev/null"
brew "syft" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p syft >/dev/null"
brew "tealdeer" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p tldr >/dev/null"
brew "tmux" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p tmux >/dev/null"
brew "trash-cli" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p trash-empty >/dev/null"
brew "tree" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p tree >/dev/null"
brew "uv" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p uv >/dev/null"
brew "xorriso" if OS.mac?
brew "ykman" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p ykman >/dev/null"
brew "ykpers" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p ykpersonalize >/dev/null"
brew "yq" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p yq >/dev/null"
brew "yt-dlp" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p yt-dlp >/dev/null"
brew "zoxide" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p zoxide >/dev/null"
brew "zsh" unless system \
      "PATH=/bin:/usr/bin:/usr/local/bin type -p zsh >/dev/null"

# 'brew install --cask'
cask "caffeine" if OS.mac?
cask "firefox" if OS.mac?
cask "font-caskaydia-cove-nerd-font" if OS.mac?
cask "font-intone-mono-nerd-font" if OS.mac?
cask "font-jetbrains-mono-nerd-font" if OS.mac?
cask "font-noto-sans-symbols-2" if OS.mac?
cask "font-sauce-code-pro-nerd-font" if OS.mac?
cask "ghostty" if OS.mac?
cask "gimp" if OS.mac?
cask "iterm2" if OS.mac?
cask "itermbrowserplugin" if OS.mac?
cask "jabra-direct" if OS.mac?
cask "maccy" if OS.mac?
cask "podman-desktop" if OS.mac?
cask "postman" if OS.mac?
cask "proton-drive" if OS.mac?
cask "proton-mail" if OS.mac?
cask "proton-pass" if OS.mac?
cask "protonvpn" if OS.mac?
cask "rectangle" if OS.mac?
cask "scap-workbench" if OS.mac?
cask "vimr" if OS.mac?
cask "vivaldi" if OS.mac?
cask "vmware-fusion" if OS.mac?
cask "zed" if OS.mac?
cask "zoom" if OS.mac?

# 'mas install'
mas "Beagle IM", id: 1445349494 if OS.mac?
mas "Tailscale", id: 1475387142 if OS.mac?